[
    {
      "content": "Tennis has a long and rich history that dates back to the 19th century. It has evolved from a lawn game to a professional sport with major tournaments like Wimbledon, the US Open, the French Open, and the Australian Open.",
      "user_id": 4,
      "post_id": 1
    },
    {
      "content": "Tennis players use a racket to hit the ball over the net. The type of racket, string tension, and grip size can greatly impact a player's performance. Tennis balls are specifically designed for the sport, with different types for various playing surfaces.",
      "user_id": 11,
      "post_id": 2
    },
    {
      "content": "Tennis can be played on different surfaces, including grass, clay, hardcourt, and carpet. Each surface affects the speed and bounce of the ball, requiring players to adapt their playing style accordingly.",
      "user_id": 13,
      "post_id": 3
    },
    {
      "content": "Tennis uses a unique scoring system with terms like 'love,' '15,' '30,' and '40.' Games are won by scoring four points and winning by at least two points. A match is typically a best-of-three or best-of-five sets, depending on the tournament.",
      "user_id": 15,
      "post_id": 4
    },
    {
      "content": "The Grand Slam tournaments are the most prestigious events in tennis. They include the Australian Open, the French Open, Wimbledon, and the US Open. Winning all four Grand Slam events in a single calendar year is known as a Grand Slam.",
      "user_id": 8,
      "post_id": 5
    },
    {
      "content": "Tennis has seen many legendary players, such as Roger Federer, Rafael Nadal, Serena Williams, and Martina Navratilova. These athletes have achieved remarkable success and left a significant impact on the sport.",
      "user_id": 10,
      "post_id": 6
    },
    {
      "content": "Tennis is not just about hitting the ball hard; it involves strategy, tactics, and mental strength. Players must decide when to serve-and-volley, rally from the baseline, and approach the net.",
      "user_id": 1,
      "post_id": 7
    },
    {
      "content": "Tennis can be played in both singles and doubles formats. Doubles requires teamwork and communication between partners, while singles emphasizes individual skills and fitness.",
      "user_id": 3,
      "post_id": 8
    },
    {
      "content": "Tennis has a set of unwritten rules and traditions, such as shaking hands with your opponent before and after a match, and adhering to a code of conduct.",
      "user_id": 6,
      "post_id": 9
    },
    {
      "content": "Tennis is a physically demanding sport that requires agility, speed, and endurance. Players often undergo rigorous training to stay in top shape.",
      "user_id": 7,
      "post_id": 10
    }
  ]
  